Autodesk.Revit.DB.CurveLoopIterator.Current
Gets the item at the current position of the iterator.
Remarks: There is no current item if the iterator has not started yet or has been done.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:  There is no current item in the iterator.
Since:
2013

Autodesk.Revit.DB.CurveLoopIterator.MoveNext
Increments the iterator to the next item.
Returns:
True if there is a next available item in this iterator.
False if the iterator has completed all available items.
Remarks:
After an enumerator is created or after the Reset method is called, an enumerator is positioned before the first element of the collection,
and the first call to the MoveNext method moves the enumerator over the first element of the collection.
Since:
2013